vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СрокиИзготовленияВПиРиски</Name>
			<Comment>ЛТ3.1</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокБазовыйДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РискУвеличенияСрокаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВоеннаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски/Forms/ФормаЗаполнения/Ext/Form/Module.bsl
&НаКлиенте
асинх Процедура Записать(Команда)
	
	текст = НСтр("ru='Записать данные в регистр?'");	
	
	Обещание = ВопросАсинх(текст, РежимДиалогаВопрос.ДаНет);
	Результат = Ждать Обещание; 
	Если Результат = КодВозвратаДиалога.Да Тогда	
		ЗаписатьНаСервере();   
		Элементы.СписокНоменклатура.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если Вариант = 0 Тогда
		Схема = Элементы.СписокНоменклатура.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	    Настройки = Элементы.СписокНоменклатура.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	    
	    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
	    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	    
	    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		Для каждого стр из Результат Цикл
			МЗ = РегистрыСведений.бит_СрокиИзготовленияВПиРиски.СоздатьМенеджерЗаписи(); 
			МЗ.Номенклатура = стр.Номенклатура;
			МЗ.ВидРабочегоЦентра = ВидРабочегоЦентра;
			МЗ.ВоеннаяПродукция = ВоеннаяПродукция;
			МЗ.СрокБазовыйДни = СрокБазовыйДни;
			МЗ.РискУвеличенияСрокаДни = РискУвеличенияСрокаДни;
			МЗ.ДатаДобавления = Дата;
			МЗ.Пользователь = Пользователь;
			МЗ.Записать(); 
		КонецЦикла;	
	Иначе
		Результат = Элементы.СписокНоменклатура.ВыделенныеСтроки;
		Для каждого стр из Результат Цикл
			МЗ = РегистрыСведений.бит_СрокиИзготовленияВПиРиски.СоздатьМенеджерЗаписи(); 
			МЗ.Номенклатура = стр;
			МЗ.ВидРабочегоЦентра = ВидРабочегоЦентра;
			МЗ.ВоеннаяПродукция = ВоеннаяПродукция;
			МЗ.СрокБазовыйДни = СрокБазовыйДни;
			МЗ.РискУвеличенияСрокаДни = РискУвеличенияСрокаДни;
			МЗ.ДатаДобавления = Дата;
			МЗ.Пользователь = Пользователь;
			МЗ.Записать(); 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	Пользователь = Пользователи.АвторизованныйПользователь();
КонецПроцедуры
